# Most used:
BACK = {
    "uz": "⬅️ Orqaga",
    "ru": "⬅️ Назад",
}

SEND_BTN = {
    "uz": "Jo'natish",
    "ru": "Отправыть",
}

# Register settings:
WELCOME_MESSAGE = "Assalomu Alaykum, Ipoteka bankning xizmatlar botiga xush kelibsiz.\n\nЗдравствуйте, добро пожаловать в сервисный бот Ипотека Банка."

ASK_LANGUAGE = "🇷🇺 Выберите язык\n🇺🇿 Tilni tanlang"

# Phone number constants:
ASK_PHONE_NUMBER = {
    "uz": "📱  Mobil raqamni kiriting Raqamingizni taqdim etish uchun quyidagi ⬇️ tugmasini bosing.",
    "ru": "📱 Введите мобильный номер Нажмите на кнопку ниже ⬇️, чтобы поделиться своим номером.",
}
ASK_PHONE_NUMBER_BTN = {
    "uz": "Jo'natish",
    "ru": "Send",
}

ASK_BIRTH_DATE = {
    "uz": "Iltimos tug'ilgan kuningizni kiriting",
    "ru": "Iltimos tug'ilgan kuningizni kiriting"
}

ASK_BIRTH_DATE_MSG = {
    "uz": "Iltimos tug'ilgan kuningizni quyidagi tartibda kiriting: faqat sonda (yil, oy, kun)",
    "ru": "Iltimos tug'ilgan kuningizni quyidagi tartibda kiriting: faqat sonda (yil, oy, kun)"
}

SKIP_BTN = {
    "uz": "Skip description",
    "ru": "Skip description",
}

WRONG_PHONE_NUMBER = {
    "uz": "Ushbu telefon raqam tizimda mavjud emas.",
    "ru": "Этот номер телефона недоступен в системе.",
}

SEND_HAPPY_BIRTHDAY = {
    "uz": "Assalomu Alaykum! Tug'ilgan kuningiz bilan Abduhakimov Fazliddin ning shaxsiy boti nomidan tabriklaymiz!",
    "ru": "Assalomu Alaykum! Tug'ilgan kuningiz bilan Abduhakimov Fazliddin ning shaxsiy boti nomidan tabriklaymiz!"
}

# Notification settings:
SENT_NOTIFY = {
    "uz": "📲 {phone_number} raqamiga jo'natilgan kodni kiriting.",
    "ru": "Введите код, отправленный на 📲 {phone_number}.",
}

WRONG_CODE = {
    "uz": "❌ Xato kod kiritildi.",
    "ru": "❌ Введен код ошибки.",
}

VERIFIED_MESSAGE = {
    "uz": "✅ Telefon raqami tasdiqlandi.",
    "ru": "✅ Номер телефона подтвержден.",
}

# Main menu:
MAIN_MENU = {
    "uz": "Asosiy menyu",
    "ru": "Главное меню",
}

PERSONAL = {
    "uz": "👕 Jismoniy shaxs",
    "ru": "👕 Физическим лицам",
}

LEGAL_ENTITY = {
    "uz": "👔 Korporativ mijozlar",
    "ru": "👔 Корпоративным клиентам",
}

SMALL_BUSINESS_N_ENTREPRENEURS = {
    "uz": "🕴 Kichik biznes va tadbirkorlik",
    "ru": "🕴 Малому бизнесу и предпринимателям",
}

COURSE_CURRENCY = {
    "uz": "💵 Valyuta kursi",
    "ru": "💵 Курсы валют",
}

BRANCHES_N_MINIBANKS = {
    "uz": "🏦 Filiallar va bankomatlar",
    "ru": "🏦 Филиалы и банкоматы",
}

MOBILE_APP = {
    "uz": "📱 Mobil ilova",
    "ru": "📱 Мобильное приложение",
}

SETTINGS = {
    "uz": "🔨 Sozlamalar",
    "ru": "🔨 Настройки",
}

CONTACT_US = {
    "uz": "☎️ Biz bilan bog'lanish",
    "ru": "☎ ️Связаться с нами",
}

MAIN_MENU_KEYBOARD = (
    PERSONAL, LEGAL_ENTITY, SMALL_BUSINESS_N_ENTREPRENEURS, COURSE_CURRENCY, BRANCHES_N_MINIBANKS, MOBILE_APP, SETTINGS)

# Keyboard in Personal:

DEPOSITS = {
    "uz": "🗄 Omonatlar",
    "ru": "🗄 Депозиты",
}

CREDITS = {
    "uz": "💰 Kreditlar",
    "ru": "💰 Кредиты",
}

CARDS = {
    "uz": "💳 Plastik kartalar",
    "ru": "💳 Пластиковые карты",
}

MONEY_TRANSFERS = {
    "uz": "💸 Pul o'tkazmalari",
    "ru": "💸 Денежные переводы",
}

CONTRIBUTIONS = {
    'uz': '🏦 Hissalar',
    'ru': "🏦 Вклады",
}

PERSONAL_KEYBOARDS = (DEPOSITS, CREDITS, CARDS,
                      MONEY_TRANSFERS, CONTRIBUTIONS, BACK)

# deposit
VIA_BANK = {
    "uz": "Bank kassalari orqali",
    "ru": "Через банковские кассы",
}

VIA_MOBILE = {
    "uz": "\"IPOTEKA MOBILE\" ilovasi orqali",
    "ru": "ЧЕРЕЗ МОБ. ПРИЛОЖЕНИЕ \"IPOTEKA MOBILE\"",
}

CONTRIBUTION_KEYBOARDS = (VIA_BANK, VIA_MOBILE, BACK)

# inner vkladi - via bank - national currency
VIA_NATIONAL_CURRENCY = {
    "uz": """<b>Нихол</b>
    <b>Процентная ставка</b>:
    - 17-18-20% годовых
    <b>Срок депозита</b>:
    - До 3-6-12 месяцев

    <b>Навкирон</b>
    <b>Процентная ставка</b>:
    - 14% годовых
    <b>Срок вклада</b>:
    - До достижения ребенком 16 лет\m

    <b>Мустакиллик</b>
    <b>Процентная ставка</b>:
    - 11% годовых
    <b>Срок вклада</b>:
    - До 12 месяцев\n
        """,

    "ru": """<b>Нихол</b>
<b>Процентная ставка</b>:
- 17-18-20% годовых
<b>Срок депозита</b>:
- До 3-6-12 месяцев

<b>Навкирон</b>
<b>Процентная ставка</b>:
- 14% годовых
<b>Срок вклада</b>:
- До достижения ребенком 16 лет\m

<b>Мустакиллик</b>
<b>Процентная ставка</b>:
- 11% годовых
<b>Срок вклада</b>:
- До 12 месяцев\n
    """,
}

VIA_INTERNATION_CURRENCY = {
    "uz": """<b>Universal</b>
<b>Валюта</b>:
- Доллары США
<b>Процентная ставка</b>:
- 3,5% - 4% годовых
<b>Срок депозита</b>:
- 3-6-9-13 месяцев
    """,
    "ru": """<b>Universal</b>
<b>Валюта</b>:
- Доллары США
<b>Процентная ставка</b>:
- 3,5% - 4% годовых
<b>Срок депозита</b>:
- 3-6-9-13 месяцев
    """,
}

# vkladi via mobile values # not yet
VIA_MOBILE_CONTRIBUTION = {
    "uz": """<b>Qulay</b>
<b>Процентная ставка</b>:
- 22% годовых
<b>Срок вклада</b>:
- До 24 месяцев
<b>Нихол онлайн</b>
<b>Процентная ставка</b>:
- 17,5% - 18,5% - 21% годовых
<b>Срок вклада</b>:
- До 3-6-12 месяцев\n
""",
    "ru": """<b>Qulay</b>
<b>Процентная ставка</b>:
- 22% годовых
<b>Срок вклада</b>:
- До 24 месяцев\n
<b>Нихол онлайн</b>
<b>Процентная ставка</b>:
- 17,5% - 18,5% - 21% годовых
<b>Срок вклада</b>:
- До 3-6-12 месяцев\n
""",
}
VIA_MOBILE_CONTRIBUTION_KEYBOARD = (BACK,)

#
PERSONAL_DEPOSIT_SOURCE_KEYBOARD = (VIA_BANK, VIA_MOBILE, BACK)

NATIONAL_CURRENCY = {
    "uz": "Milliy valyutada",
    "ru": "В национальной валюте",
}

INTERNATION_CURRENCY = {
    "uz": "Chet el valutasida",
    "ru": "В иностранной валюте",
}

PERSONAL_CURRENCY_KEYBOARD = (NATIONAL_CURRENCY, INTERNATION_CURRENCY, BACK)

CONTRIBUTION_VIA_BANK_KEYBOARDS = (
    NATIONAL_CURRENCY, INTERNATION_CURRENCY, BACK)

# Money transfers category

WESTERN_UNION = {
    "uz": "WESTERN_UNION",
    "ru": "WESTERN_UNION"
}
GOLDEN_CRONE = {
    "uz": "Золотая Корона",
    "ru": "Золотая Корона"
}

MONEY_GRAM = {
    "uz": "Money Gram",
    "ru": "Money Gram"
}

CONTACT = {
    "uz": "Contact",
    "ru": "Contact"
}

CONTACT_MSG = {
    "uz": "Отправка денежных средств по системе «Contact» В СТРАНЫ СНГ комиссия 1% от суммы перевода \nОтправка денежных средств по системе «Contact» В ДРУГИЕ СТРАНЫ комиссия 3% от суммы перевода",
    "ru": "Отправка денежных средств по системе «Contact» В СТРАНЫ СНГ комиссия 1% от суммы перевода \nОтправка денежных средств по системе «Contact» В ДРУГИЕ СТРАНЫ комиссия 3% от суммы перевода",
}

ASIA_EXPRESS = {
    "uz": "АзияЭкспресс",
    "ru": "АзияЭкспресс"
}

ASIA_EXPRESS_MSG = {
    "uz": "Страна присутствия Системы: Узбекистан, Россия (Москва)\nКомиссия за отправление денежного перевода от суммы перевода 1.40% не менее 1 USD/EUR",
    "ru": "Страна присутствия Системы: Узбекистан, Россия (Москва)\nСтрана присутствия Системы: Узбекистан, Россия (Москва)",
}

PAYSEND = {
    "uz": "Paysend",
    "ru": "Paysend"
}

PAYSEND_MSG = {
    "uz": "<b>Любая сумма денежных переводов</b>:\n\n- Россия - 49₽\n- Казакстана - 199₸\n- Европа - 1.5€\n- США - 2$\n- Великобритания - 1£",
    "ru": "<b>Любая сумма денежных переводов</b>:\n\n- Россия - 49₽\n- Казакстана - 199₸\n- Европа - 1.5€\n- США - 2$\n- Великобритания - 1£"
}

UniStream = {
    "uz": "UniStream",
    "ru": "UniStream",
}

UNISTREAM_MSG = {
    "uz": 'выгружается файлt с данными из листа "Юнистрим"',
    "ru": 'выгружается файл с данными из листа "Юнистрим"',
}

RIA = {
    "uz": "RIA",
    "ru": "RIA"
}

RIA_MSG = {
    "uz": 'выгружается файл с данными из листа "Ria"',
    "ru": 'выгружается файл с данными из листа "Ria"',
}

MONEY_TRANSFERS_KEYBOARD = (
    WESTERN_UNION, UniStream, GOLDEN_CRONE, MONEY_GRAM, CONTACT, RIA, ASIA_EXPRESS, PAYSEND, BACK)

# western child categories
WESTERN_CENTRAL_ASIA = {
    "uz": "Азербайджан, Армения, Белоруссия, Грузия, Кыргызстан, Молдова, Россия, Таджикистан, Туркменистан, Казахстан, Украина ...",
    "ru": "Азербайджан, Армения, Белоруссия, Грузия, Кыргызстан, Молдова, Россия, Таджикистан, Туркменистан, Казахстан, Украина ...",
}

WESTERN_CHINA = {
    "uz": "Китай",
    "ru": "Китай",
}

WESTERN_OAE = {
    "uz": "ОАЭ",
    "ru": "ОАЭ",
}

WESTERN_ALL_COUNTRIES = {
    "uz": "Все страны, кроме стран указанных в перечне СНГ, Китай и Узбекистан",
    "ru": "Все страны, кроме стран указанных в перечне СНГ, Китай и Узбекистан",
}

WESTERN_UNION_KEYBOARD = (
    WESTERN_OAE, WESTERN_CENTRAL_ASIA, WESTERN_CHINA, WESTERN_ALL_COUNTRIES, BACK)

# western inner categories, keyboard
WESTERN_CENTRAL_ASIA_SPECIAL = {
    "uz": "Тариф «Срочный»",
    "ru": "Тариф «Срочный»",
}

WESTERN_CENTRAL_ASIA_SPECIAL_MSG = {
    "uz": """<b>Тариф «Срочный»</b>

<b>Сумма перевода</b>:           <b>Тариф</b>:
• 0,01-200,00                       $ 3.00
• 200,01-2000,00                1,7%
• 2000.01-3000.00              1.3%
• 3000.01 и более              1.0%
             """,
    "ru": """<b>Тариф «Срочный»</b>

<b>Сумма перевода</b>:           <b>Тариф</b>:
• 0,01-200,00                       $ 3.00
• 200,01-2000,00                1,7%
• 2000.01-3000.00              1.3%
• 3000.01 и более              1.0%
             """,
}

WESTERN_CENTRAL_ASIA_TWELWE_HOURS = {
    "uz": "Тариф «12 часов»",
    "ru": "Тариф «12 часов»",
}

WESTERN_CENTRAL_ASIA_TWELWE_HOURS_MSG = {

    "uz": """<b>Тариф «12 часов»</b>

    <b>Сумма перевода</b>:           <b>Тариф</b>:
    • 0,01-200,00                      $ 2.00
    • 200,01-300,00                  1,0%
    • 300,01-3000,00                0.5%
                 """,
    "ru": """<b>Тариф «12 часов»</b>

<b>Сумма перевода</b>:           <b>Тариф</b>:
• 0,01-200,00                      $ 2.00
• 200,01-300,00                  1,0%
• 300,01-3000,00                0.5%
             """,
}

WESTERN_CHINA_MSG = {
    "uz": """<b>Китай</b>

<b>Сумма перевода</b>:       <b>Тариф</b>:
• 100,00 и меньше       15,00
• 100,01-300,00             20,00
• 300,01-500,00             25,00
• 500,01-800,00             30,00
• 800,01-1000,00           35,00
• 1000,01-1500,00         40,00
• 1500,01-2000,00         45,00
• 2000,01-5000,00         50,00""",
    "ru": """<b>Китай</b>
 
<b>Сумма перевода</b>:       <b>Тариф</b>:
• 100,00 и меньше       15,00
• 100,01-300,00             20,00
• 300,01-500,00             25,00
• 500,01-800,00             30,00
• 800,01-1000,00           35,00
• 1000,01-1500,00         40,00
• 1500,01-2000,00         45,00
• 2000,01-5000,00         50,00"""
}

WESTERN_OAE_MSG = {
    "uz": """<b>ОАЭ</b>

<b>Сумма перевода</b>:       <b>Тариф</b>:
• 0,01-100,00                  15,00
• 100,01-300,00               20,00
• 300,01-500,00               25,00
• 500,01-800,00               30,00
• 800,01-1000,00             35,00
• 1000,01-1500,00           40,00
• 1500,01-2000,00           45,00
• 2000,01-3000,00           50,00
• 3000,01-5000,00           60,00
             """,
    "ru": """<b>ОАЭ</b>

<b>Сумма перевода</b>:       <b>Тариф</b>:
• 0,01-100,00                  15,00
• 100,01-300,00              20,00
• 300,01-500,00              25,00
• 500,01-800,00              30,00
• 800,01-1000,00            35,00
• 1000,01-1500,00          40,00
• 1500,01-2000,00          45,00
• 2000,01-3000,00          50,00
• 3000,01-5000,00          60,00
         """,
}

WESTERN_ALL_COUNTRIES_MSG = {
    "uz": """<b>Страны дальнего зарубежья</b>

Сумма перевода:                 Тариф:
• 50,00 и меньше                  13,00
• 50,01-100,00                          15,00
• 100,01-200,00                        22,00
• 200,01-300,00                        29,00
• 300,01-400,00                        34,00
• 400,01-500,00                        40,00
• 500,01-750,00                        45,00
• 750,01-1 000,00                     51,00
• 1 000,01-1 500,00                  76,00
• 1 500,01-1 750,00                  81,00
• 1 750,01-2 000,00                  91,00
• 2 000,01-2 500,00                  111,00
• 2 500,01-3 000,00                  121,00
• 3 000,01-3 500,00                  141,00
• 3 500,01-4 000,00                  161,00
         """,
    "ru": """<b>Страны дальнего зарубежья</b>

Сумма перевода:                 Тариф:
• 50,00 и меньше                  13,00
• 50,01-100,00                          15,00
• 100,01-200,00                        22,00
• 200,01-300,00                        29,00
• 300,01-400,00                        34,00
• 400,01-500,00                        40,00
• 500,01-750,00                        45,00
• 750,01-1 000,00                     51,00
• 1 000,01-1 500,00                  76,00
• 1 500,01-1 750,00                  81,00
• 1 750,01-2 000,00                  91,00
• 2 000,01-2 500,00                  111,00
• 2 500,01-3 000,00                  121,00
• 3 000,01-3 500,00                  141,00
• 3 500,01-4 000,00                  161,00
         """,
}

WESTERN_CENTRAL_ASIA_KEYBOARD = (
    WESTERN_CENTRAL_ASIA_SPECIAL, WESTERN_CENTRAL_ASIA_TWELWE_HOURS, BACK)

# money tranfers golden crone side
GOLDEN_CRONE_ASIA = {
    "uz": "Россия, Грузия, Кыргызстан, Беларусь, Казахстан, Таджикистан",
    "ru": "Россия, Грузия, Кыргызстан, Беларусь, Казахстан, Таджикистан"
}

GOLDEN_CRONE_ASIA_MSG = {
    "uz": "1% от суммы перевода, но не более 25$ США или 25€ за каждый перевод",
    "ru": "1% от суммы перевода, но не более 25$ США или 25€ за каждый перевод",
}

GOLDEN_CRONE_EUROPE = {
    "uz": "Испания, Италия, Бельгия, Сербия, Черногория, Македония, Германия",
    "ru": "Испания, Италия, Бельгия, Сербия, Черногория, Македония, Германия",
}
GOLDEN_CRONE_EUROPE_MSG = {
    "uz": "1,5% от суммы перевода",
    "ru": "1,5% от суммы перевода"
}

GOLDEN_CRONE_CENTRAL_ASIA = {
    "uz": "Азербайджан, Абхазия, Молдова, Израиль, Монголия, ОАЭ, Чехия",
    "ru": "Азербайджан, Абхазия, Молдова, Израиль, Монголия, ОАЭ, Чехия",
}

GOLDEN_CRONE_CENTRAL_ASIA_NEXT = {
    "uz": "Великобритания, Северная Ирландия, Латвия, Литва, Греция, Болгария, Кипр, Португалия, Румыния, Франция, Нидерланды, Египет, Иордания",
    "ru": "Великобритания, Северная Ирландия, Латвия, Литва, Греция, Болгария, Кипр, Португалия, Румыния, Франция, Нидерланды, Египет, Иордания",
}

GOLDEN_CRONE_CENTRAL_ASIA_MSG = {
    "uz": "1% от суммы перевода",
    "ru": "1% от суммы перевода",
}

GOLDEN_CRONE_CHINA = {
    "uz": "Китай",
    "ru": "Китай",
}

GOLDEN_CRONE_CHINA_MSG = {
    "uz": "0,7% от суммы перевода, но не более 25$ США за каждый перевод",
    "ru": "0,7% от суммы перевода, но не более 25$ США за каждый перевод",
}

GOLDEN_CRONE_KOREA = {
    "uz": "Южная Корея",
    "ru": "Южная Корея",
}
GOLDEN_CRONE_KOREA_MSG = {
    "uz": "10$ США независимо от суммы отправителя",
    "ru": "10$ США независимо от суммы отправителя",
}

GOLDEN_CRONE_FREE = {
    "uz": "На выдачу наличных денежных средств",
    "ru": "На выдачу наличных денежных средств",
}

GOLDEN_CRONE_KEYBOARD = (
    GOLDEN_CRONE_KOREA, GOLDEN_CRONE_CHINA, GOLDEN_CRONE_CENTRAL_ASIA, GOLDEN_CRONE_EUROPE, GOLDEN_CRONE_ASIA,
    GOLDEN_CRONE_CENTRAL_ASIA_NEXT, BACK
)

# money gram
MONEY_GRAM_MIX = {
    "uz": "Великобритания, Ирландия, Израиль, Канада, Республика Корея, Малайзия, ОАЭ, США, Турция, Чехия",
    "ru": "Великобритания, Ирландия, Израиль, Канада, Республика Корея, Малайзия, ОАЭ, США, Турция, Чехия",
}

MONEY_GRAM_MIX_MSG = {
    "uz": """<b>Великобритания, Ирландия, Израиль, Канада, Южная Корея, Малайзия, ОАЭ, США, Турция, Чехия</b>

<b>Сумма перевода</b>:              <b>Комиссия</b>:
• 0,01-100,00                              10$
• 100,01-300,00                          18$
• 300,01-500,00                          20$
• 500,01-800,00                          25$
• 800,01-1000,00                        30$
• 1000,01-1500,00                      35$
• 1500,01-2000,00                      40$
• 2000,01-3000,00                      45$
• 3000,01-5000,00                      50$""",
    "ru": """<b>Великобритания, Ирландия, Израиль, Канада, Южная Корея, Малайзия, ОАЭ, США, Турция, Чехия</b>

<b>Сумма перевода</b>:              <b>Комиссия</b>:
• 0,01-100,00                              10$
• 100,01-300,00                          18$
• 300,01-500,00                          20$
• 500,01-800,00                          25$
• 800,01-1000,00                        30$
• 1000,01-1500,00                      35$
• 1500,01-2000,00                      40$
• 2000,01-3000,00                      45$
• 3000,01-5000,00                      50$"""
}

MONEY_GRAM_RUSSIA = {
    "uz": "Армения, Беларусь, Казахстан, Кыргызстан, Молдова, Россия, Таджикистан и Грузия",
    "ru": "Армения, Беларусь, Казахстан, Кыргызстан, Молдова, Россия, Таджикистан и Грузия",
}

MONEY_GRAM_CENTRAL_RUSSIA_MSG = {
    "uz": """  
<b>Армения, Беларусь, Казахстан, Кыргызстан, Молдова, Россия, Таджикистан и Грузия</b>

<b>Сумма перевода</b>:             <b>Комиссия</b>:
• 0.01 - 200                                  3$
• 200.01 - 400                              6$
• 400.01 - 600                              9$
• 600.01 - 800                              12$
• 800.01 - 1000                            15$
• 1000.01 - 2000                          30$
• 2000.01- 3000                           36$
• 3000.01- 4000                           40$
• 4000.01- 5000                           50$
         """,
    "ru": """  
<b>Армения, Беларусь, Казахстан, Кыргызстан, Молдова, Россия, Таджикистан и Грузия</b>

<b>Сумма перевода</b>:             <b>Комиссия</b>:
• 0.01 - 200                                  3$
• 200.01 - 400                              6$
• 400.01 - 600                              9$
• 600.01 - 800                              12$
• 800.01 - 1000                            15$
• 1000.01 - 2000                          30$
• 2000.01- 3000                           36$
• 3000.01- 4000                           40$
• 4000.01- 5000                           50$
         """,
}

MONEY_GRAM_CHINA = {
    "uz": "Китай",
    "ru": "Китай",
}

MONEY_GRAM_CHINA_MSG = {
    "uz": """<b>Китай</b>

<b>Сумма перевода</b>:             <b>Комиссия</b>:
• 0.01 - 300                                   9$
• 300,01 - 600                              18$
• 600,01 - 1000                            25$
• 1000,01 - 1500                          35$
• 1500,01 - 2000                          40$
• 2000,01 - 10000                        45$
         """,
    "ru": """<b>Китай</b>

<b>Сумма перевода</b>:             <b>Комиссия</b>:
• 0.01 - 300                                   9$
• 300,01 - 600                              18$
• 600,01 - 1000                            25$
• 1000,01 - 1500                          35$
• 1500,01 - 2000                          40$
• 2000,01 - 10000                        45$
         """,
}

MONEY_GRAM_UKRAIN = {
    "uz": "Украина, Туркменистан",
    "ru": "Украина, Туркменистан",
}

MONEY_GRAM_UKRAIN_MSG = {
    "uz": """<b>Украина, Туркменистан</b>

<b>Сумма перевода</b>:                 <b>Комиссия</b>: 
• 0.01 - 200                                      5$
• 200.01 - 400                                  9$
• 400.01 - 600                                  15$
• 600.01 - 1000                                20$
• 1000.01 - 1500                              35$
• 1000.01 - 1500                              35$
• 1500.01 - 2000                              40$
• 2000.01 - 3000                              45$
• 3000.01 - 4000                              50$
• 4000.01 - 5000                              60$
         """,

    "ru": """<b>Украина, Туркменистан</b>

<b>Сумма перевода</b>:                 <b>Комиссия</b>: 
• 0.01 - 200                                      5$
• 200.01 - 400                                  9$
• 400.01 - 600                                  15$
• 600.01 - 1000                                20$
• 1000.01 - 1500                              35$
• 1000.01 - 1500                              35$
• 1500.01 - 2000                              40$
• 2000.01 - 3000                              45$
• 3000.01 - 4000                              50$
• 4000.01 - 5000                              60$
         """,
}

MONEY_GRAM_ALL = {
    "uz": "Страны дальнего зарубежья, кроме Великобритании, Ирландии, Израиля, Канады, Китая, Кореи, Малайзии, ОАЭ, США, Турции",
    "ru": "Страны дальнего зарубежья, кроме Великобритании, Ирландии, Израиля, Канады, Китая, Кореи, Малайзии, ОАЭ, США, Турции",
}

MONEY_GRAM_ALL_MSG = {
    "ru": """<b>Страны дальнего зарубежья</b>

<b>Сумма перевода</b>:                            <b>Комиссия</b>:
• 0.01-100                                                     10$
• 100.01 - 250                                               18$
• 250.01 - 400                                               24$
• 400.01 - 600                                               34$
• 600.01 - 800                                               39$
• 800.01 - 1000                                            44$
• 1000.01 - 1200                                          60$
• 1200.01 - 1800                                          65$
• 1800.01 - 2500                                          70$
• 2500.01 - 5000                                          100$
         """,
}

MONEY_GRAM_KEYBOARD = (MONEY_GRAM_CHINA, MONEY_GRAM_UKRAIN,
                       MONEY_GRAM_MIX, MONEY_GRAM_RUSSIA, MONEY_GRAM_ALL, BACK)

# credit
IPO_CREDIT = {
    "uz": "Ipoteka kreditlari",
    "ru": "Ипотечные кредиты",
}

IPO_CREDIT_MSG = {
    "uz": """<b>Oson Ipoteka</b>.\n
<b>Kreditning maqsadi</b>:
- Birlamchi bozorda uy-joy sotib olish uchun

<b>Kreditning maksimal miqdori</b>:
- Qoraqalpog‘iston Respublikasi va viloyatlar uchun 327,25 mln. so'mni tashkil etadi
- Toshkent shahri bo‘yicha 416,5 mln. so\'m

<b>Kredit muddati</b>:
- 20 yil
        
<b>Stavka miqdori</b>:
- Toshkent shahrida yillik 18%
- O‘zbekiston Respublikasining boshqa shaharlari va qishloq tumanlarida yillik 17%. 
        
<b>Boshlang'ich to'lov</b>: \n- 15%""",

    "ru": """<b>Осон ипотека</b>\n
<b>Цель кредита</b>:
- Для приобретения жилья на первичном рынке
        
<b>Максимальная сумма кредита</b>:
- Для Республики Каракалпакстан и областей  327.25млн.сумов
- Для города Ташкента 416.5 млн.сумов
        
<b>Срок кредита</b>:
- На 20 лет
        
<b>Процентная ставка</b>:
- 18% годовых по г.Ташкенту 
- 17% годовых в остальных городах и сельских территориях РУз. 
        
<b>Первоначальный взнос</b>: \n- 15%""",
}

CONSUMER_CREDIT = {
    "uz": "Iste'mol kreditlari",
    "ru": "Потребительские кредиты",
}

CREDIT_TYPE_KEYBOARD = (IPO_CREDIT, CONSUMER_CREDIT, BACK)

# CONSUMER_CREDIT
CONSUMER_CREDIT_MIKROZIME = {
    "uz": "Микрозайм Фидокор",
    "ru": "Микрозайм Фидокор",
}

CONSUMER_CREDIT_MIKROZIME_MSG = {
    "uz": """<b>Микрозайм Фидокор</b>\n
<b>Цель кредита</b>: 
- Для личных целей
\n<b>Сумма кредита</b>:
- До 100 БРВ (базовая расчетная величина)\n
<b>Минимальная сумма:</b>
- 1 млн. сум\n
<b>Срок</b>:    
- До 24 месяцев\n 
<b>Процентная ставка</b>:
- 23% годовых\n""",

    "ru": """<b>Микрозайм Фидокор</b>\n
<b>Цель кредита</b>: 
- Для личных целей
\n<b>Сумма кредита</b>:
- До 100 БРВ (базовая расчетная величина)\n
<b>Минимальная сумма:</b>
- 1 млн. сум\n
<b>Срок</b>:    
- До 24 месяцев\n 
<b>Процентная ставка</b>:
- 23% годовых\n""",
}

CONSUMER_CREDIT_STUDY = {
    "uz": "Образовательный кредит ",
    "ru": "Образовательный кредит ",
}

LEARN_CREDIT = {
    "uz": "Образовательный кредит ",
    "ru": "Образовательный кредит ",
}

CONSUMER_STUDY = {
    "uz": 'Образовательный кредит ',
    "ru": 'Образовательный кредит ',
}

FADIN = {
    "uz": "Образовательный кредит",
    "ru": "Образовательный кредит",
}
FADIN_MSG = {
    "uz": """<b>Образовательный кредит</b>\n
<b>Цель кредита</b>: 
- Для оплаты учёбы на контрактной основе очной формы обучения бакалавра и магистратуры всех высших учебных заведений, действующих в Республике Узбекистан.\n
<b>Максимальная сумма кредита:</b>
- Сумма контрактного годового платежного договора\n
<b>Срок кредита</b>:
- Основной долг погашается в течении 7 лет с седьмого месяца после окончания официального срока обучения студента\n
<b>Процентная ставка кредита</b>:
- По установленной базовой ставке ЦБ (на текущий день 14%)
- При уменьшении базовой ставки ЦБ, ставка кредита уменьшается
- При повышении базовой ставки ЦБ, процентная ставка кредита остаётся неизменной 
""",

    "ru": """<b>Образовательный кредит</b>\n
<b>Цель кредита</b>: 
- Для оплаты учёбы на контрактной основе очной формы обучения бакалавра и магистратуры всех высших учебных заведений, действующих в Республике Узбекистан.\n
<b>Максимальная сумма кредита:</b>
- Сумма контрактного годового платежного договора\n
<b>Срок кредита</b>:
- Основной долг погашается в течении 7 лет с седьмого месяца после окончания официального срока обучения студента\n
<b>Процентная ставка кредита</b>:
- По установленной базовой ставке ЦБ (на текущий день 14%)
- При уменьшении базовой ставки ЦБ, ставка кредита уменьшается
- При повышении базовой ставки ЦБ, процентная ставка кредита остаётся неизменной """,
}

CONSUMER_STUDY_MSG = {
    "uz": "Образовательный кредит Цель кредита - Для оплаты учёбы на контрактной основе очной формы обучения бакалавра и магистратуры всех высших учебных заведений, действующих в Республике Узбекистан. Максимальная сумма кредита - Сумма контрактного годового платежного договора Срок кредита - Основной долг погашается в течение 7 лет с седьмого месяца после окончания официального срока обучения студента Процентная ставка кредита - По установленной базовой ставке ЦБ (на текущий день 14%). При уменшении базовой ставки ЦБ, ставка кредита тоже уменшаеться. Но при повышении базовой ставки ЦБ, процентная ставка кредита остаёться неизменимым. ",
    "ru": "Образовательный кредит Цель кредита - Для оплаты учёбы на контрактной основе очной формы обучения бакалавра и магистратуры всех высших учебных заведений, действующих в Республике Узбекистан. Максимальная сумма кредита - Сумма контрактного годового платежного договора Срок кредита - Основной долг погашается в течение 7 лет с седьмого месяца после окончания официального срока обучения студента Процентная ставка кредита - По установленной базовой ставке ЦБ (на текущий день 14%). При уменшении базовой ставки ЦБ, ставка кредита тоже уменшаеться. Но при повышении базовой ставки ЦБ, процентная ставка кредита остаёться неизменимым. ",
}

CONSUMER_CREDIT_ONLINE_MIKROZIME = {
    "uz": "Онлайн микрозайм",
    "ru": "Онлайн микрозайм",
}

CONSUMER_CREDIT_ONLINE_MIKROZIME_MSG = {
    "uz": """"<b>Онлайн микрозайм</b>\n
<b>Цель кредита</b>: 
- Для личных целей
\n<b>Сумма кредита</b>:
- До 100 БРВ (базовая расчетная величина)\n
<b>Минимальная сумма:</b>
- 1 млн. сум\n
<b>Срок</b>:    
- До 24 месяцев\n 
<b>Процентная ставка</b>:
- 23% годовых
- 34.5% годовых для просроченного кредита""",

    "ru": """<b>Онлайн микрозайм</b>\n
<b>Цель кредита</b>: 
- Для личных целей
\n<b>Сумма кредита</b>:
- До 100 БРВ (базовая расчетная величина)\n
<b>Минимальная сумма:</b>
- 1 млн. сум\n
<b>Срок</b>:    
- До 24 месяцев\n 
<b>Процентная ставка</b>:
- 23% годовых
- 34.5% годовых для просроченного кредита""",
}

CONSUMER_CREDIT_INNER = {
    "uz": "Потребительский кредит",
    "ru": "Потребительский кредит"
}

CONSUMER_CREDIT_MSG = {
    "uz": """<b>Потребительский кредит</b>\n
<b>Цель кредита</b>: 
- Для приобретения товаров и услуг, произведенных в Республике Узбекистан\n
<b>Срок кредита</b>:
- До 3 лет\n
<b>Максимальный размер кредита:</b>
- До 150 БРВ (базовая расчетная величина)\n
<b>Процентная ставка</b>:
- 26% годовых\n""",

    "ru": """<b>Потребительский кредит</b>\n
<b>Цель кредита</b>: 
- Для приобретения товаров и услуг, произведенных в Республике Узбекистан\n
<b>Срок кредита</b>:
- До 3 лет\n
<b>Максимальный размер кредита:</b>
- До 150 БРВ (базовая расчетная величина)\n
<b>Процентная ставка</b>:
- 26% годовых\n""",
}

PERSONAL_CONSUMER_CREDITS = (
    CONSUMER_CREDIT_MIKROZIME, CONSUMER_CREDIT_ONLINE_MIKROZIME, CONSUMER_CREDIT_INNER, CONSUMER_STUDY, BACK
)

UZCARD_CARD = {
    "uz": "Uzcard",
    "ru": "Uzcard",
}

UZCARD_CARD_MSG = {
    "uz": """Uzcard \n
<b>Валюта</b>: 
- Узбекский сум 
<b>Депозит</b>: 
- Нет 
<b>Стоимость выпуска</b>: 
- 25 000 сум""",
    "ru": """Uzcard \n
<b>Валюта</b>: 
- Узбекский сум 
<b>Депозит</b>: 
- Нет 
<b>Стоимость выпуска</b>: 
- 25 000 сум""",
}

HUMO_CARD = {
    "uz": "HUMO",
    "ru": "HUMO"
}

HUMO_CARD_MSG = {
    "uz": """HUMO \n
<b>Валюта</b>: 
- Узбекский сум 
<b>Депозит</b>: 
- Нет 
<b>Стоимость выпуска</b>: 
- 10 000 сум""",

    "ru": """HUMO \n
<b>Валюта</b>: 
- Узбекский сум 
<b>Депозит</b>: 
- Нет 
<b>Стоимость выпуска</b>: 
- 10 000 сум""",
}

NATIONAL_CURRENCY_CARDS = (UZCARD_CARD, HUMO_CARD, BACK)

MASTERCARD_STANDART_CARD = {
    "uz": "Mastercard STANDART",
    "ru": "Mastercard STANDART",
}

MASTERCARD_STANDART_CARD_MSG = {
    "uz": """Mastercard STANDART\n
<b>Валюта</b>: 
- Доллары США
<b>Депозит</b>: 
- 10 долларов США
<b>Стоимость выпуска</b>:
- 20 000 сум""",
    "ru": """Mastercard STANDART\n
<b>Валюта</b>: 
- Доллары США
<b>Депозит</b>: 
- 10 долларов США
<b>Стоимость выпуска</b>:
- 20 000 сум""",
}

MASTERCARD_GOLD_CARD = {
    "uz": "Mastercard GOLD",
    "ru": "Mastercard GOLD",
}

MASTERCARD_GOLD_CARD_MSG = {
    "uz": """Mastercard GOLD\n
<b>Валюта</b>: 
- Доллары США
<b>Депозит</b>: 
- 10 долларов США
<b>Стоимость выпуска</b>:
- 40 000 сум""",
    "ru": """Mastercard GOLD\n
<b>Валюта</b>: 
- Доллары США
<b>Депозит</b>: 
- 10 долларов США
<b>Стоимость выпуска</b>:
- 40 000 сум""",
}

INTERNATION_CURRENCY_CARDS = (
    MASTERCARD_STANDART_CARD, MASTERCARD_GOLD_CARD, BACK)

# card
CARD_UZCARD = {
    "uz": "Uzcard",
    "ru": "Uzcard",
}

CARD_HUMO = {
    "uz": "HUMO",
    "ru": "HUMO",
}

# corporate clients

CREDIT_BUSINESS = {
    "uz": "Biznes kreditlash",
    "ru": "Кредитование бизнеса",
}

CORPORATE_CARDS = {
    "uz": "Korporativ kartalar",
    "ru": "Корпоративные карты",
}

CASH_SERVICES = {
    "uz": "Hisob-kitob va kassa xizmatlari",
    "ru": "Расчетно-кассовое обслуживание",
}

LIST_CORPORATE_KEYBOARDS = (
    CREDIT_BUSINESS, CORPORATE_CARDS, DEPOSITS, CASH_SERVICES, BACK)

# entrepreneur
LEASING = {
    "uz": "Lizing",
    "ru": "Лизинг",
}

SMALL_BUSINESS_CREDIT = {
    "uz": "Kichik biznesni kreditlash",
    "ru": "Кредитование малого бизнеса",
}

BANK_GUARANTEES = {
    "uz": "Bank kafolati",
    "ru": "Банковские гарантии",
}

CORPORATE_BANK_CARDS = {
    "uz": "Korporativ bank kartalari",
    "ru": "Корпоративные пластиковые карты",
}

LIST_ENTREPRENEURS = (LEASING, SMALL_BUSINESS_CREDIT,
                      BANK_GUARANTEES, CORPORATE_BANK_CARDS, BACK)

# branches

TINCHLIK_BRANCH = {
    "uz": "Тинчликский филиал",
    "ru": "Тинчликский филиал",
}

TINCHLIK_ADDRESS = {
    "uz": "г. Ургенч, Тинчлик 22-дом",
    "ru": "г. Ургенч, Тинчлик 22-дом",
}

KARAKALPAK_BRANCH = {
    "uz": "Каракалпакский Республиканский филиал",
    "ru": "Каракалпакский Республиканский филиал",
}

KARAKALPAK_ADDRESS = {
    "uz": "г. Нукус, ул. А.Шамуротова",
    "ru": "г. Нукус, ул. А.Шамуротова",
}

KHOREZM_BRANCH = {
    "uz": "Хорезмский областной филиал",
    "ru": "Хорезмский областной филиал",
}

KHOREZM_ADDRESS = {
    "uz": "город Ургенч, ул. Узбекистан 19-дом",
    "ru": "город Ургенч, ул. Узбекистан 19-дом",
}

KOKAN_BRANCH = {
    "uz": "Кокандский филиал",
    "ru": "Кокандский филиал",
}

KOKAN_BRANCH_ADDRESS = {
    "uz": "г. Коканд, Алишер Навои 164-дом",
    "ru": "г. Коканд, Алишер Навои 164-дом"
}

FERGANA_BRANCH = {
    "uz": "Фергана",
    "ru": "Фергана",
}

FERGANA_BRANCH_ADDRESS = {
    "uz": "г. Фергана, ул. Комус, 38-дом",
    "ru": "г. Фергана, ул. Комус, 38-дом",
}

SIRDARYA_BRANCH = {
    "uz": "Сырдарьинский областной филиал",
    "ru": "Сырдарьинский областной филиал",
}

SIRDARYA_BRANCH_ADDRESS = {
    "uz": "г. Гулистон, Алишер Навои 53-дом",
    "ru": "г. Гулистон, Алишер Навои 53-дом",
}

SURKHANDARYA_BRANCH = {
    "uz": "Сурхандарьинский областной филиал",
    "ru": "Сурхандарьинский областной филиал",
}

SURKHANDARYA_BRANCH_ADDRESS = {
    "uz": "г. Термез, ул. Фирдавсий 75-дом",
    "ru": "г. Термез, ул. Фирдавсий 75-дом",
}

SAMARKAND_BRANCH = {
    "uz": "Самарканд",
    "ru": "Самарканд",
}

SAMARKAND_BRANCH_ADDRESS = {
    "uz": "г. Самарканд, ул. Беруний, 31-дом",
    "ru": "г. Самарканд, ул. Беруний, 31-дом",
}

KUKSARAY_BRANCH = {
    "uz": "Куксарайский филиал",
    "ru": "Куксарайский филиал",
}

KUKSARAY_BRANCH_ADDRESS = {
    "uz": "г. Самарканд, ул. Фирдавсий 75",
    "ru": "г. Самарканд, ул. Фирдавсий 75",
}

NAMANGAN_BRANCH = {
    "uz": "Наманганский областной филиал",
    "ru": "Наманганский областной филиал",
}

NAMANGAN_BRANCH_ADDRESS = {
    "uz": "г. Наманган, ул. Навоий, 63-дом",
    "ru": "г. Наманган, ул. Навоий, 63-дом",
}

DJIZZAKH_BRANCH = {
    "uz": "Джизакский областной филиал",
    "ru": "Джизакский областной филиал",
}

DJIZZAKH_BRANCH_ADDRESS = {
    "uz": "г. Джиззах, ул. Ш. Рашидов 72-дом",
    "ru": "г. Джиззах, ул. Ш. Рашидов 72-дом",
}

KASHKADARYA_BRANCH = {
    "uz": "Кашкадарья",
    "ru": "Кашкадарья"
}

KASHKADARYA_BRANCH_ADDRESS = {
    "uz": "г. Карши, ул. Мустакиллик, 49-дом",
    "ru": "г. Карши, ул. Мустакиллик, 49-дом",
}

SHAKHRISABZ_BRANCH = {
    "uz": "Шахрисабзский филиал",
    "ru": "Шахрисабзский филиал",
}

SHAKHRISABZ_BRANCH_ADDRESS = {
    "uz": "г. Шахрисабз, ул. Ипак йоли, 3-дом",
    "ru": "г. Шахрисабз, ул. Ипак йоли, 3-дом",
}

NAVAI_BRANCH = {
    "uz": "Навоийский областной филиал",
    "ru": "Навоийский областной филиал",
}

NAVAI_BRANCH_ADDRESS = {
    "uz": "г.Навои, ул. Меморлар, 1а-дом",
    "ru": "г. Навои, ул. Меморлар, 1а-дом",
}

ZARAFSHAN_BRANCH = {
    "uz": "Зарафшанский филиал",
    "ru": "Зарафшанский филиал",
}

ZARAFSHAN_BRANCH_ADDRESS = {
    "uz": "г. Зарафшан, 2-микрорайон",
    "ru": "г. Зарафшан, 2-микрорайон",
}

ISTIKLAL_BRANCH = {
    "uz": "Истиклол",
    "ru": "Истиклол",
}
ISTIKLAL_BRANCH_ADDRESS = {
    "uz": "г. Андижан, ул. Истиклол 22",
    "ru": "г. Андижан, ул. Истиклол 22",
}

ANDIJAN_BRANCH = {
    "uz": "Андижанский филиал",
    "ru": "Андижанский филиал",
}

ANDIJAN_BRANCH_ADDRESS = {
    "uz": "г. Андижан, Анисий 1",
    "ru": "г. Андижан, Анисий 1",
}

CHIRCHIQ_BRANCH = {
    "uz": "Чирчикский филиал",
    "ru": "Чирчикский филиал",
}

CHIRCHIQ_BRANCH_BRANCH = {
    'uz': "г. Чирчик, ул. Межканалная, 1-дом",
    'ru': "г. Чирчик, ул. Межканалная, 1-дом"
}

ZANGIATA_BRANCH = {
    "uz": "Зангиатинский филиал",
    'ru': 'Зангиатинский филиал'
}

ZANGIATA_BRANCH_ADDRESS = {
    "uz": "г. Зангиота, ул. А.Темур, 178-дом",
    "ru": "г. Зангиота, ул. А.Темур, 178-дом",
}

CHINAZ_BRANCH = {
    "uz": "Чиназский филиал",
    "ru": "Чиназский филиал"
}

CHINAZ_BRANCH_ADDRESS = {
    "uz": "г. Чиноз, ул. Ш.Рашидов, 20-дом",
    "ru": "г. Чиноз, ул. Ш.Рашидов, 20-дом",
}

DUSTABAD_BRANCH = {
    "uz": "Дустабадский филиал",
    "ru": "Дустабадский филиал",
}

DUSTABAD_BRANCH_ADDRESS = {
    "uz": "г. Дустабад, р-н. Куйи-чирчикский, ул. Аккурган, 1-дом",
    "ru": "г. Дустабад, р-н. Куйи-чирчикский, ул. Аккурган, 1-дом",
}

BEKABAD_BRANCH = {
    "uz": "Бекабадский филиал",
    "ru": "Бекабадский филиал",
}
BEKABAD_BRANCH_ADDRESS = {
    "uz": "г. Бекобод, ул. Саломатлик , 1-дом",
    "ru": "г. Бекобод, ул. Саломатлик , 1-дом",
}

AKHANGARAN_BRANCH = {
    "uz": "Ахангаранский филиал",
    "ru": "Ахангаранский филиал",
}

AKHANGARAN_BRANCH_ADDRESS = {
    "uz": "г. Охангарон, ул. Охунбобоев, 1-дом",
    "ru": "г. Охангарон, ул. Охунбобоев, 1-дом",
}

ALMALIK_BRANCH = {
    "uz": "Алмалыкский филиал",
    "ru": "Алмалыкский филиал",
}

ALMALIK_BRANCH_ADDRESS = {
    "uz": "г. Олмалик, улица Фахрийлар, 27-дом",
    "ru": "г. Олмалик, улица Фахрийлар, 27-дом"
}

ANGREN_BRANCH = {
    "uz": "Ангренский филиал",
    "ru": "Ангренский филиал",
}

ANGREN_BRANCH_ADDRESS = {
    "uz": "г. Ангрен, ул. Навоий, 1-дом",
    "ru": "г. Ангрен, ул. Навоий, 1-дом"
}

TASHKENT_REGION_BRANCH = {
    "uz": "Ташкентский областной филиал",
    "ru": "Ташкентский областной филиал"
}

TASHKENT_REGION_ADDRESS = {
    "uz": "г. Ташкент, ул. Ширин, 40-дом",
    "ru": "г. Ташкент, ул. Ширин, 40-дом",
}

SARDAR_BRANCH = {
    "uz": "Сардор",
    "ru": "Сардор"
}

SARDAR_BRANCH_ADDRESS = {
    "uz": "г. Бухара, ул. Жалол Икрамов, 6-дом",
    "ru": "г. Бухара, ул. Жалол Икрамов, 6-дом",
}

BUKHARA_BRANCH = {
    "uz": "Бухоро",
    'ru': "Бухоро",
}

BUKHARA_BRANCH_ADDRESS = {
    "uz": "г. Бухара, ул. Икбол, 10-дом",
    "ru": "г. Бухара, ул. Икбол, 10-дом",
}

SHAYKHANTAKHUR_BRANCH = {
    "uz": "Шайхантахурский филиал",
    "ru": "Шайхантахурский филиал",
}

SHAYKHANTAKHUR_BRANCH_ADDRESS = {
    "uz": "100027, г. Ташкент, ул. Узбекистан, 16а",
    "ru": "100027, г. Ташкент, ул. Узбекистан, 16а",
}

TASHKENT_BRANCH = {
    "uz": "Ташкент",
    "ru": "Ташкент",
}

BRANCHES_MIX_KEYBOARD = (
    TINCHLIK_BRANCH, KARAKALPAK_BRANCH, KHOREZM_BRANCH, KOKAN_BRANCH, FERGANA_BRANCH, SIRDARYA_BRANCH,
    SURKHANDARYA_BRANCH,
    SAMARKAND_BRANCH, KUKSARAY_BRANCH, NAMANGAN_BRANCH, DJIZZAKH_BRANCH, KASHKADARYA_BRANCH, SHAKHRISABZ_BRANCH,
    NAVAI_BRANCH,
    ZARAFSHAN_BRANCH, ISTIKLAL_BRANCH, ANDIJAN_BRANCH, CHIRCHIQ_BRANCH, ZANGIATA_BRANCH, CHINAZ_BRANCH, DUSTABAD_BRANCH,
    BEKABAD_BRANCH, AKHANGARAN_BRANCH, ANGREN_BRANCH, TASHKENT_REGION_BRANCH, SARDAR_BRANCH, BUKHARA_BRANCH,
    SHAYKHANTAKHUR_BRANCH, TASHKENT_BRANCH, BACK)

TASHKENT_CITY_BRANCH = {
    "uz": "Ташкентский Городской филиал",
    "ru": "Ташкентский Городской филиал",
}

TASHKENT_CITY_BRANCH_ADDRESS = {
    "uz": "100000, г. Ташкент, проспект Мустакиллик",
    "ru": "100000, г. Ташкент, проспект Мустакиллик",
}

MAIN_OPERATSION_RULE = {
    "uz": "Главное операционное управление",
    "ru": "Главное операционное управление",
}

MAIN_OPERATSION_RULE_ADDRESS = {
    "uz": "100000, г. Ташкент, Улица Шахрисабз",
    "ru": "100000, г. Ташкент, Улица Шахрисабз",
}

TASHKENT_ALMAZAR = {
    "uz": "Алмазарский филиал",
    "ru": "Алмазарский филиал",
}

TASHKENT_ALMAZAR_ADDRESS = {
    "uz": "100174, г. Ташкент, ул. Фаробий, 5",
    "ru": "100174, г. Ташкент, ул. Фаробий, 5",
}

TASHKENT_MEKHNAT = {
    "uz": "Мехнатский филиал",
    "ru": "Мехнатский филиал",
}

TASHKENT_MEKHNAT_ADDRESS = {
    "uz": "100000, г. Ташкент, ул. Истиклол 9",
    "ru": "100000, г. Ташкент, ул. Истиклол 9",
}

TASHKENT_SERGELI = {
    "uz": "Сергелийский филиал",
    "ru": "Сергелийский филиал",
}
TASHKENT_SERGELI_ADDRESS = {
    "uz": "100209, г. Ташкент, ул. Мехригиё, 1",
    "ru": "100209, г. Ташкент, ул. Мехригиё, 1",
}

TASHKENT_YAKKASARAY = {
    "uz": "Яккасарайский филиал",
    "ru": "Яккасарайский филиал",
}

TASHKENT_YAKKASARAY_ADDRESS = {
    "uz": "100013, г. Ташкент, ул. Усмон Носир",
    "ru": "100013, г. Ташкент, ул. Усмон Носир",
}

TASHKENT_CHILANZAR = {
    "uz": "Чиланзарский филиал",
    "ru": "Чиланзарский филиал",
}

TASHKENT_CHILANZAR_MESSAGE = {
    "uz": "100113, г. Ташкент, ул. Катартал, 37",
    "ru": "100113, г. Ташкент, ул. Катартал, 37",
}

TASHKENT_YASHNABAD = {
    "uz": "Яшнободский филиал",
    "ru": "Яшнободский филиал",
}

TASHKENT_YASHNABAD_MESSAGE = {
    "uz": "100071, г. Ташкент, ул. Лисунова, 69а",
    "ru": "100071, г. Ташкент, ул. Лисунова, 69а",
}

TASHKENT_YUNUSABAD = {
    "uz": "Юнусабадский филиал",
    "ru": "Юнусабадский филиал",
}

TASHKENT_YUNUSABAD_ADDRESS = {
    "uz": "100084, г. Ташкент, ул. Амир Темур, 89",
    "ru": "100084, г. Ташкент, ул. Амир Темур, 89",
}

TASHKENT_MIRABAD = {
    "uz": "Мирабадский филиал",
    "ru": "Мирабадский филиал",
}

TASHKENT_MIRABAD_MESSAGE = {
    "uz": "100105, г. Ташкент, ул. Талимарджан, 1 б",
    "ru": "100105, г. Ташкент, ул. Талимарджан, 1 б",
}

TASHKENT_BRANCHES_KEYBOARD = (
    TASHKENT_CITY_BRANCH, MAIN_OPERATSION_RULE,
    TASHKENT_ALMAZAR, TASHKENT_MEKHNAT, TASHKENT_SERGELI, TASHKENT_YAKKASARAY, TASHKENT_CHILANZAR, TASHKENT_YASHNABAD,
    TASHKENT_YUNUSABAD, TASHKENT_MIRABAD, BACK)

# tashkent branch inner catetgories


MONEY_TRANSFERS_CONTACT_FIRST = {
    "uz": "Отправка денежных средств по системе «Contact» В СТРАНЫ СНГ комиссия 1% от суммы перевода",
    "ru": "Отправка денежных средств по системе «Contact» В СТРАНЫ СНГ комиссия 1% от суммы перевода",
}

MONEY_TRANSFERS_CONTACT_SECOND = {
    "uz": "Отправка денежных средств по системе «Contact» В ДРУГИЕ СТРАНЫ комиссия 3% от суммы перевода",
    "ru": "Отправка денежных средств по системе «Contact» В ДРУГИЕ СТРАНЫ комиссия 3% от суммы перевода",
}

MONEY_TRANSFERS_CONTACT_KEYBOARD = (
    MONEY_TRANSFERS_CONTACT_FIRST, MONEY_TRANSFERS_CONTACT_SECOND, BACK)

MONEY_TRANSFERS_ASIA_EXPRESS = {
    "uz": "Страна присутствия Системы: Узбекистан, Россия (Москва)",
    "ru": "Страна присутствия Системы: Узбекистан, Россия (Москва)",
}

MONEY_TRANSFERS_ASIA_EXPRESS_MSG = {
    "uz": "Комиссия за отправление денежного перевода от суммы перевода 1.40% не менее 1 USD/EUR",
    "ru": "Комиссия за отправление денежного перевода от суммы перевода 1.40% не менее 1 USD/EUR",
}

MONEY_TRANSFERS_ASIA_EXPRESS_KEYBOARD = (MONEY_TRANSFERS_ASIA_EXPRESS, BACK)

# Settings:


CHANGE_LANGUAGE = {
    "uz": "🌐 Tilni o'zgartirish",
    "ru": "🌐 Сменить язык",
}

SETTINGS_KEYBOARDS = (CHANGE_LANGUAGE, BACK)

# Contact us:
CALL_BANK = {
    "uz": "Bankga qo'ng'iroq qilish",
    "ru": "Позвонить в Банк",
}

WRITE_CONSULTANT = {
    "uz": "Konsultantga yozish",
    "ru": "Написать консультанту",
}

CALL_US = {
    "uz": "Call center: (78) 150-11-22\nContact center: 1233",
    "ru": "Call center: (78) 150-11-22\nContact center: 1233",
}

LIST_KEYBOARDS_CONTACT_US = (CALL_BANK, WRITE_CONSULTANT, BACK)

# FeedBack
WRITE_FEEDBACK = {
    "uz": "Xabarlaringizni yozing va oxirida jo'natish tugmasini bosing",
    "ru": "Напишите свои сообщения и нажмите кнопку отправки в конце",
}

THANKS_FEEDBACK = {
    "uz": "FeedBack uchun rahmat",
    "ru": "Спасибо за фидбек",
}

NO_FEEDBACK_ERROR = {
    "uz": "Feedback topilmadi, iltimos, qayta yozib keyin yuboring",
    "ru": "Отзыв не найден, пожалуйста, напишите еще раз после повторного отправить",
}

SKIP_DESCRIPTION = {
    "uz": "No description",
    "ru": "No description",
}

WRITE_CONSULTANT_KEYBOARD = (SEND_BTN, SKIP_BTN, BACK)
# Currency:
CURRENCY = {
    "uz": "🏛 Valyuta kurslari",
    "ru": "🏛 Курс валюты"
}

# Button namings:

# language
UZBEK = "🇺🇿 O'zbek tili"
RUSSIAN = "🇷🇺 Русский язык"

LIST_LANG = (UZBEK, RUSSIAN)

LIST_CHANGE_LANGUAGE = (UZBEK, RUSSIAN, BACK)

# Off topic:
ERROR = "Xatolik sodir bo'ldi. Iltimos, xatoliklarni oldini olish uchun /start tugmasini bosib, qaytadan boshlang."

CHOOSE = {
    "uz": "Bo'limni tanlang:",
    "ru": "Выберите раздел:",
}

CONTINUE = {
    "uz": "Davom ettirish",
    "ru": "Продолжение",
}

RESTART = {
    "uz": "Qaytadan yozish",
    "ru": "Переписать",
}

ERROR_CHOICE = {
    "uz": "Qaytadan tanlang!\n\nXatolik yana takrorlansa, /start tugmasini bosing!",
    "ru": "Выберите еще раз!\n\nЕсли ошибка повторится, нажмите кнопку /start!",
}

NO_CONTENT = {
    "uz": "Ma'lumotlar tez orada yuklanadi",
    "ru": "Данные скоро будут загружены",
}

PHONE_NUMBER_EXISTS = {
    "uz": "Telefon raqam tizimda mavjud. Boshqatdan urinib ko'ring, yoki adminlarga murojaat qiling.",
    "ru": "Номер телефона доступен в системе. Пожалуйста, попробуйте еще раз или свяжитесь с администраторами.",
}
